<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>About</title>
</head>
<!-- //// Header //// -->
<?php include('../magica/header.php'); ?>
<!-- //// Header //// -->

<body>
    <div class="bg-about">
        <div class="title-about">
            <!-- <img class="title-img-about" src="asset/img/aboutMGC.png" alt=""> -->
            <p id="txt-title-policy">ข้อกำหนดและเงื่อนไข</p>
            <p id="txt-content-policy">
                นโยบายความเป็นส่วนตัว
                ความเป็นส่วนตัวของผู้ใช้งานมีความสำคัญมากสำหรับเรา นโยบายความเป็นส่วนตัวนี้ได้สร้างขึ้นเพื่อคุ้มครองสิทธิของผู้ใช้งาน โปรดอ่านนโยบายความเป็นส่วนตัวอย่างละเอียดเพื่อให้เข้าใจว่า Dr.Magica เก็บรวบรวมและใช้ข้อมูลที่เกี่ยวกับบัญชีของผู้ใช้งาน หากผู้ใช้งานมีข้อสงสัยเกี่ยวกับข้อมูลเหล่านี้หรือข้อปฏิบัติว่าด้วยความเป็นส่วนตัวของ Dr.Magica
                โปรดติดต่อเราได้ทางช่องทางที่ระบุข้างล่าง <br><br>

                <b>การจัดเก็บข้อมูลส่วนตัว</b>
                Dr.Magica จะเก็บข้อมูลส่วนบุคคลใดไว้บ้าง?<br>
                Dr.Magica จะเก็บรวบรวมข้อมูลของผู้ใช้งานที่เข้าใช้งานเว็บไซต์ของ Dr.Magica และจะเก็บข้อมูลเมื่อผู้ใช้งานมีการลงทะเบียนหรือสมัครสมาชิกบนเว็บไซต์ Dr.Magica
                ผู้ใช้งานจะต้องให้ข้อมูล ชื่อ อีเมล์ เบอร์โทรศัพท์ และรายละเอียดอื่น ๆ ที่จะสนับสนุนการใช้งานที่ดีขึ้นบนเว็บไซต์ Dr.Magica
                <br><br>
                <b>Dr.Magica จะเก็บรวบรวมข้อมูลเมื่อใด? </b> <br>
                Dr.Magica จะเก็บรวบรวมข้อมูลเมื่อผู้ใช้งานสมัครสมาชิกบนเว็บไซต์ Dr.Magica เมื่อผู้ใช้งานกรอกแบบฟอร์ม หรือกรอกข้อมูลอื่น ๆ บนเว็บไซต์ Dr.Magica <br>

              <br>  <b> การใช้และการเปิดเผยข้อมูลส่วนตัว</b> <br>
                Dr.Magica มีวิธีการใช้ข้อมูลที่ผู้ใช้งานให้แก่เราอย่างไรบ้าง? <br>
                Dr.Magica ใช้ข้อมูลที่ผู้ใช้งานให้แก่เราเมื่อผู้ใช้งานสมัครสมาชิกบนเว็บไซต์ การท่องเว็บไซต์ หรือการใช้คุณลักษณะอื่น ๆของเว็บไซต์ ซึ่ง Dr.Magica จะใช้ข้อมูลที่ผู้ใช้งานให้แก่เรา ดังเงื่อนไขต่อไปนี้ : <br>

                1.เพื่อให้ Dr.Magica สามารถตอบสนองความต้องการของผู้ใช้งานและเพื่อมอบบริการที่ดีที่สุดแก่ผู้ใช้งาน <br>
                2.เพื่อให้สามารถตอบสนองการทำธุรกรรมใด ๆ บนเว็บไซต์ Dr.Magica อย่างเร็วที่สุด<br>

               <br> <b>การเปิดเผยข้อมูลแก่บุคคลภายนอก (Third-party)</b> <br>
                Dr.Magica ไม่ขาย แลกเปลี่ยน หรือโอนข้อมูลส่วนบุคคลของผู้ใช้งานให้แก่บุคคลภายนอก <br>

              <br>  <b>การเชื่อมโยงกับบุคคลที่ภายนอก</b> <br>
                ในบางกรณี Dr.Magica อาจเสนอผลิตภัณฑ์หรือบริการของบุคคลภายนอก บนเว็บไซต์ ซึ่งขึ้นอยู่กับดุลยพินิจของ Dr.Magica ซึ่งเว็บไซต์ของบุคคลภายนอก เหล่านี้มีนโยบายความเป็นส่วนตัวที่แยกต่างหากและเป็นอิสระต่อ Dr.Magica ดังนั้น Dr.Magica จะไม่รับผิดชอบต่อเนื้อหาหรือกิจกรรมใด ๆ ที่เป็นของเว็บไซต์ที่เชื่อมโยง อย่างไรก็ตาม Dr.Magica พยายามที่จะปกป้องและรักษาคุณสมบัติในการการใช้งานของเว็บไซต์ให้สมบูรณ์ที่สุด และ Dr.Magica ยินดีรับข้อเสนอแนะเกี่ยวกับเว็บไซต์ โดยสามารถแจ้งข้อเสนอแนะได้ที่ **** อีเมล ****
                ในกรณีที่เป็นข้อยกเว้นและ Dr.Magica ถูกขอให้เปิดเผยข้อมูลส่วนตัว เช่นในกรณีที่มีมูลให้เชื่อว่าการเปิดเผยดังกล่าวอาจป้องกันการข่มขู่ต่อชีวิตหรือร่างกาย สำหรับวัตถุประสงค์ในการบังคับใช้กฎหมาย หรือการปฏิบัติตามกฎหมาย ระเบียบ ข้อบังคับหรือการร้องขออื่นใด
                Dr.Magica อาจส่งมอบข้อมูลส่วนตัวของผู้ใช้งานให้แก่บุคคลภายนอกหรือบริษัทในเครือสำหรับวัตถุประสงค์ดังกล่าวมาข้างต้น โดยเฉพาะอย่างยิ่งเพื่อดำเนินธุรกรรมต่าง ๆ กับท่านให้สำเร็จ จัดการบัญชีการใช้บริการของท่าน การตลาด การปฏิบัติตามกฎหมาย ระเบียบข้อบังคับ การร้องขออื่น ๆ ที่ Dr.Magica เห็นว่าจำเป็น ในการแบ่งปันข้อมูลให้แก่บุคคลดังกล่าว Dr.Magica จะพยายามอย่างถึงที่สุดเพื่อรับรองว่าบุคคลภายนอกและบริษัทในเครือของเราจะรักษาและปกป้องข้อมูลส่วนตัวของผู้ใช้งานจากการเข้าถึง การจัดเก็บ การใช้ การเปิดเผย โดยไม่ได้รับอนุญาต หรือความเสี่ยงอื่น ๆ ในลักษณะเดียวกัน
                การเชื่อมโยงกับ Google <br>

              <br>  <b> ความปลอดภัยของข้อมูลส่วนตัวของท่าน</b> <br>
                Dr.Magica คุ้มครองข้อมูลส่วนบุคคลของผู้ใช้งานอย่างไรบ้าง?<br>
                เว็บไซต์ Dr.Magica ใช้การสแกนมัลแวร์แบบปกติ และเว็บไซต์จะถูกตรวจสอบเป็นประจำเพื่อความปลอดภัยจากช่องโหว่ด้านความปลอดภัย (security holes) เพื่อให้ผู้ใช้งานได้เยี่ยมชมเว็บไซต์ของเราโดยมีความปลอดภัยที่สุด

                ข้อมูลส่วนบุคคลของผู้ใช้จะถูกเก็บโดยมีเครือข่ายความปลอดภัยและเป็นเพียงเข้าถึงได้โดยจำกัดจำนวนผู้มีสิทธิ์พิเศษในระบบดังกล่าว และจะต้องเก็บข้อมูลเป็นความลับ นอกจากนี้ข้อมูลที่เป็นความลับหรือมีความสำคัญทั้งหมดของผู้ใช้งาน จะถูกเข้ารหัสผ่านทางเทคโนโลยี Secure Socket Layer ( SSL )
                <br>
                <br><b>การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว</b> <br>
                เมื่อนโยบายความเป็นส่วนตัวนี้ถูกสร้างขึ้น Dr.Magica จะทำการเพิ่มลิงค์เพื่อเชื่อมต่อนโยบายความเป็นส่วนตัวลงบนเว็บไซต์หน้าแรก หรือระบุไว้ในส่วนที่สำคัญของเว็บไซต์ ผู้ใช้จะได้รับแจ้งการเปลี่ยนแปลงใด ๆ ในนโยบายความเป็นส่วนตัว บนหน้านโยบายความเป็นส่วนตัวของเว็บ Dr.Magica และผู้ใช้สามารถเปลี่ยนแปลงข้อมูลส่วนตัวโดยการเข้าสู่บัญชีของผู้ใช้งาน

                การเพิกถอนความยินยอม
                ผู้ใช้งานอาจส่งคำคัดค้านการใช้หรือการเปิดเผยข้อมูลส่วนตัวของผู้ใช้งานสำหรับกิจการต่าง ๆ แก่เราได้ตลอดเวลา โดยติดต่อเราผ่านทางอีเมลที่ระบุข้างล่าง โปรดทราบว่าหากผู้ใช้งานได้ส่งคำคัดค้านการใช้งานหรือการเปิดเผยข้อมูลส่วนตัวสำหรับกิจกรรมต่าง ๆ จะขึ้นอยู่กับพฤติการณ์ของคำคัดค้าน Dr.Magica อาจไม่อยู่ในสถานะที่จะบริการให้แก่ผู้ใช้งานหรือปฏิบัติตามสัญญาต่อผู้ใช้งานได้ Dr.Magica ขอสงวนสิทธิทางกฎหมายและการเยียวยาไว้โดยชัดแจ้งในกรณีซึ่งเราไม่สามารถบริการให้แก่ผู้ใช้งานหรือตามปฏิบัติตามสัญญาต่อผู้ใช้งานได้อันเกิดจากคำคัดค้านดังกล่าว

                การติดต่อ Dr.Magica
                หากผู้ใช้งานต้องการเพิกถอนความยินยอมในการใช้ข้อมูลส่วนตัวของผู้ใช้งาน ขอเรียกดูข้อมูลและ/หรือข้อมูลส่วนตัว มีคำถาม ความคิดเห็น ข้อกังวล หรือขอความช่วยเหลือทางด้านเทคนิค กรุณาติดต่อเราได้ดังช่องทางต่อไปนี้
                <br><br>
                <b>Email : may.3929@gmail.com</b> <br>
                <b>Facebook : Dr.Magica</b> <br>
                <b>ปรับปรุงครั้งล่าสุด : 21 พฤศจิกายน พ.ศ. 2565</b>
            </p><br><br><br>
        </div>

    </div>
</body>
<?php include('../magica/footer.php'); ?>
<script src="/magica/action.js"></script>

</html>